01  WS-AREA-1 PIC X(10).
01  WS-AREA-2 PIC 9(5).
01  WS-AREA-3 PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
    MOVE "Hello" TO WS-AREA-1 
    ADD 10 TO WS-AREA-3
    DISPLAY WS-AREA-1 WS-AREA-3
    STOP RUN.